inletTest3/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          |
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         |
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom       patch;

sourceCase          ".";

sourcePatches       (test_0);
exposedPatchName    test_0;

flipNormals         true;

nLayers             10;

expansionRatio      1.2;

extrudeModel        linearNormal;

linearNormalCoeffs
{
    thickness          0.01;
}

mergeFaces          false;
mergeTol        1e-8;

// ************************************************************************* //
